import React from "react";
import {
  Container,
  LiStyle,
  UlStyle,
  SpanStyle,
  TextStyle,
  OlLiStyle
} from "./ItemModal.Style";

export const ItemModal = () => {
  return (
    <Container>
      <TextStyle style={{marginBottom: '20px'}}><b>№1. ПОВЕРНЕННЯ ТОВАРУ НАЛЕЖНОЇ ЯКОСТІ</b></TextStyle>
      <TextStyle>
        Повернення товару належної якості проводиться протягом 14-ти днів з
        моменту отримання споживачем замовлення та за виконання наступних умов і
        згідно з Ст. 9. Закону України "Про захист прав споживачів":
      </TextStyle>
      <UlStyle>
        <LiStyle>
          товар не був у використанні та збережено його товарний вигляд;
        </LiStyle>
        <LiStyle>не пошкоджені (не відірвані) пломби та ярлики;</LiStyle>
        <LiStyle>
          наявний документ, який підтверджує здійснення покупки.
        </LiStyle>
      </UlStyle>
      <SpanStyle>ВАЖЛИВО:</SpanStyle>
      <TextStyle>Ваші дії при поверненні товару належної якості:</TextStyle>
      <ol>
        <OlLiStyle>
          Зателефонувати за номером 093 107 4140, назвати номер вашого
          замовлення і причину повернення;
        </OlLiStyle>
        <OlLiStyle>Отримати від менеджера реквізити для зворотної доставки;</OlLiStyle>
        <OlLiStyle>
          <TextStyle>Відправити товар на вказану менеджером адресу.</TextStyle>
          <SpanStyle>ВАЖЛИВО:</SpanStyle>
          <UlStyle>
            <LiStyle>
              проконтролюйте, щоб працівники пошти не згинали навпіл
              сумку\рюкзак або інший виріб, щоб не допустити заломів матеріалів;
            </LiStyle>
            <LiStyle>
              доставка при поверненні продукції здійснюється за рахунок покупця;
            </LiStyle>
          </UlStyle>
        </OlLiStyle>

        <OlLiStyle>
          <TextStyle>
            Повідомити менеджеру номер ТТН, щоб ваше відправлення змогли
            ідентифікувати;
          </TextStyle>
          <SpanStyle>ВАЖЛИВО:</SpanStyle>
          <UlStyle>
            <LiStyle>
              якщо під час огляду товару, який повертається від покупця будуть
              виявлені сліди використання, пошкодження, відсутність пломб та
              ярликів, які унеможливлять перепродаж товару – продавцем буде
              складено «акт огляду товару», описані недоліки\пошкодження та
              відправлено разом з товаром назад покупцеві.
            </LiStyle>
          </UlStyle>
        </OlLiStyle>
        <OlLiStyle>
          Очікувати повернення коштів на платіжну картку протягом наступних 7-ми
          днів з моменту отримання посилки на відділенні пошти.
        </OlLiStyle>
      </ol>
    </Container>
  );
};
